package by.cadememy.Homework1;

public class CaseSwitch {
	
	public static void main(String[] args) {
		System.out.println("Hello");
	
		/*
		 * Задача 2.
Создайте массив из всех нечётных чисел от 1 до 99, 
выведите его на экран в строку, а затем этот же массив выведите на экран тоже в строку, но в обратном порядке (99 97 95 93 … 7 5 3 1).
		 */
	}

}
